location1 3866
location2 968
london 865
area 841
live 563
place 372
nice 324
good 286
like 276
would 225
also 205
expensive 185
part 170
lot 162
around 158
one 154
great 152
central 145
go 139
quite 139
really 136
lived 128
get 125
bit 121
near 121
people 119
south 117
tube 113
think 112
well 110
much 106
station 106
year 102
best 100
safe 99
street 99
line 91
road 89
want 89
train 87
crime 84
restaurant 83
west 82
close 81
try 81
bad 79
centre 79
know 79
borough 77
north 77
look 76
park 76
pretty 76
shop 76
bar 75
house 75
many 75
time 75
living 73
say 73
could 69
going 69
night 68
still 66
transport 66
far 65
better 64
probably 63
east 62
find 62
market 62
used 62
right 61
take 61
town 61
cheap 60
lovely 59
shopping 59
etc 57
cheaper 56
even 55
feel 55
flat 55
suburb 55
though 54
avoid 53
bus 52
high 52
somewhere 52
link 51
looking 51
large 50
minute 50
life 49
need 48
big 47
end 47
village 47
way 47
never 46
rough 46
price 45
pub 45
see 45
might 44
walk 44
away 43
day 43
love 43
always 42
easy 42
stay 42
work 42
either 41
come 40
however 40
money 40
thing 40
called 39
rent 39
full 38
little 38
afford 37
community 37
kent 37
load 37
location 37
old 37
affordable 36
museum 36
river 36
young 36
born 35
club 35
greater 35
surrey 35
actually 34
le 34
move 34
ok 34
school 34
two 34
generally 33
got 33
green 33
problem 33
cafe 32
cheapest 32
rate 32
recommend 32
within 32
beautiful 31
definitely 31
may 31
suggest 31
anywhere 30
fairly 30
month 30
visit 30
cool 29
family 29
friend 29
mean 29
student 29
another 28
budget 28
coming 28
first 28
home 28
maybe 28
new 28
personally 28
travel 28
30 27
although 27
dangerous 27
decent 27
depends 27
different 27
estate 27
main 27
moving 27
next 27
posh 27
side 27
space 27
st 27
yes 27
zone 27
housing 26
long 26
trendy 26
especially 25
quiet 25
uk 25
essex 24
fine 24
found 24
underground 24
along 23
class 23
commute 23
council 23
known 23
nicer 23
open 23
plenty 23
property 23
public 23
said 23
thames 23
county 22
district 22
heard 22
local 22
middle 22
choice 21
consider 21
every 21
excellent 21
lively 21
min 21
music 21
pleasant 21
round 21
safest 21
small 21
square 21
sure 21
worth 21
agree 20
alot 20
back 20
bet 20
enough 20
garden 20
indian 20
inner 20
mostly 20
nearby 20
nicest 20
outside 20
rail 20
rich 20
slightly 20
tourist 20
tower 20
working 20
access 19
address 19
example 19
help 19
jewish 19
mainly 19
option 19
popular 19
safer 19
stop 19
world 19
10 18
apartment 18
check 18
choose 18
connection 18
ever 18
fast 18
huge 18
idea 18
lane 18
name 18
northern 18
prefer 18
pricey 18
reputation 18
service 18
towards 18
upmarket 18
whole 18
cockney 17
cost 17
easily 17
fact 17
general 17
head 17
hill 17
hope 17
located 17
major 17
moved 17
outer 17
population 17
residential 17
suburban 17
walking 17
able 16
bridge 16
cinema 16
else 16
food 16
friendly 16
fun 16
leafy 16
make 16
number 16
run 16
sw 16
without 16
affluent 15
alternative 15
based 15
country 15
enjoy 15
famous 15
history 15
last 15
late 15
map 15
mentioned 15
mile 15
neighbourhood 15
offer 15
opinion 15
particularly 15
railway 15
range 15
rather 15
richmond 15
se 15
three 15
worst 15
black 14
busy 14
buy 14
dont 14
extremely 14
free 14
getting 14
hi 14
job 14
kind 14
luck 14
mate 14
nightlife 14
piccadilly 14
poor 14
relatively 14
site 14
someone 14
term 14
trouble 14
type 14
vibrant 14
website 14
went 14
20 13
amazing 13
corner 13
currently 13
drug 13
due 13
dump 13
edge 13
gang 13
hour 13
often 13
okay 13
palace 13
pay 13
perhaps 13
plus 13
point 13
regent 13
rest 13
surrounding 13
week 13
white 13
ago 12
airport 12
bed 12
built 12
considered 12
couple 12
course 12
culture 12
direct 12
distance 12
dlr 12
everything 12
favourite 12
honest 12
including 12
jubilee 12
keep 12
low 12
mind 12
moment 12
nothing 12
others 12
oxford 12
person 12
real 12
ride 12
since 12
something 12
stuff 12
thinking 12
unsafe 12
use 12
yeah 12
asian 11
attraction 11
become 11
bedroom 11
building 11
child 11
city 11
dodgy 11
eat 11
frequent 11
hamlet 11
hotel 11
im 11
journey 11
lower 11
must 11
postcode 11
question 11
reasonable 11
royal 11
seems 11
seen 11
share 11
start 11
summer 11
value 11
venue 11
wrong 11
almost 10
anyone 10
anything 10
average 10
bank 10
basically 10
border 10
certainly 10
cultural 10
desirable 10
everyone 10
fair 10
gatwick 10
happens 10
horrible 10
information 10
interesting 10
least 10
likely 10
longer 10
man 10
particular 10
per 10
priced 10
rock 10
show 10
similar 10
sort 10
spend 10
sunday 10
theatre 10
there 10
told 10
top 10
urban 10
wealthy 10
15 9
25 9
40 9
across 9
alone 9
alright 9
answer 9
band 9
british 9
capital 9
church 9
clean 9
common 9
cosmopolitan 9
english 9
evening 9
eye 9
give 9
gorgeous 9
half 9
higher 9
highest 9
hip 9
kid 9
level 9
list 9
lol 9
londoner 9
million 9
modern 9
national 9
overground 9
peaceful 9
pick 9
police 9
professional 9
proper 9
reasonably 9
recently 9
saturday 9
short 9
sound 9
spent 9
stayed 9
thought 9
true 9
victorian 9
worse 9
000 8
american 8
apart 8
art 8
artist 8
bexley 8
boy 8
college 8
connected 8
convenient 8
court 8
deprived 8
diverse 8
everywhere 8
exactly 8
except 8
felt 8
form 8
guess 8
hand 8
harrod 8
highly 8
isnt 8
ive 8
knife 8
loved 8
met 8
morning 8
noisy 8
rd 8
read 8
reason 8
room 8
saying 8
seriously 8
state 8
store 8
thanks 8
thats 8
traffic 8
via 8
wanted 8
weekend 8
wembley 8
18 7
accessible 7
amenity 7
ancient 7
anyway 7
ask 7
bangladeshi 7
became 7
ben 7
book 7
boring 7
buckingham 7
commuter 7
compared 7
curry 7
directly 7
doubt 7
drive 7
england 7
fantastic 7
fashionable 7
girl 7
ground 7
guide 7
ha 7
happening 7
happy 7
hole 7
husband 7
id 7
immigrant 7
includes 7
king 7
liked 7
literally 7
made 7
mary 7
metropolitan 7
mixed 7
named 7
nw 7
olympic 7
olympics 7
outskirt 7
pocket 7
possible 7
postal 7
punk 7
put 7
reach 7
remember 7
research 7
resident 7
route 7
sadly 7
served 7
several 7
sister 7
sorry 7
tel 7
tho 7
tree 7
university 7
unless 7
using 7
variety 7
view 7
whereas 7
wide 7
worked 7
youre 7
020 6
1965 6
accommodation 6
advise 6
afraid 6
already 6
alternatively 6
atmosphere 6
aware 6
becoming 6
believe 6
bell 6
block 6
bloody 6
brilliant 6
call 6
car 6
case 6
catch 6
cause 6
character 6
closer 6
completely 6
dog 6
drink 6
ethnic 6
expect 6
facility 6
fancy 6
field 6
financial 6
four 6
ghetto 6
grew 6
grotty 6
group 6
gun 6
hang 6
happen 6
hub 6
imagine 6
inside 6
irish 6
jack 6
library 6
looked 6
lucky 6
mainline 6
massive 6
misinformed 6
mugged 6
multi 6
muslim 6
natural 6
nearest 6
neighbour 6
proximity 6
queen 6
quieter 6
reading 6
record 6
rental 6
renting 6
rural 6
scary 6
set 6
single 6
spot 6
stall 6
system 6
ten 6
unfortunately 6
vibe 6
victoria 6
visa 6
warned 6
22 5
35 5
45 5
absolutely 5
accent 5
advice 5
afro 5
agent 5
aint 5
al 5
amount 5
arsenal 5
attractive 5
avenue 5
baker 5
behind 5
biggest 5
boundary 5
bring 5
business 5
care 5
celebrity 5
change 5
commuting 5
comparison 5
considering 5
contains 5
cover 5
cross 5
crowded 5
cycling 5
dark 5
depressing 5
development 5
dirty 5
early 5
edit 5
eg 5
fan 5
farm 5
favorite 5
figure 5
finding 5
flight 5
gem 5
girlfriend 5
gone 5
hall 5
hence 5
hidden 5
historic 5
hometown 5
ie 5
improving 5
interested 5
italian 5
junction 5
land 5
largest 5
leicester 5
let 5
light 5
listed 5
liverpool 5
making 5
mix 5
multicultural 5
mum 5
n7 5
nasty 5
nearer 5
neighborhood 5
noise 5
non 5
obviously 5
offered 5
office 5
older 5
originally 5
parliament 5
partner 5
paul 5
perfect 5
perfectly 5
phone 5
play 5
racing 5
recent 5
running 5
seem 5
shot 5
smaller 5
soul 5
southeast 5
standard 5
staying 5
stick 5
studying 5
subway 5
super 5
taken 5
talking 5
tell 5
tends 5
terrible 5
therefore 5
touristy 5
trafalgar 5
turkish 5
uni 5
upper 5
vintage 5
wise 5
woman 5
wonderful 5
yet 5
